In [2]:
from pandas import Series,DataFrame
import pandas as pd
import numpy as np

In [3]:
obj = Series([4,7,-5,3])
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [5]:
obj.values

array([ 4,  7, -5,  3])

In [6]:
obj.index

RangeIndex(start=0, stop=4, step=1)

In [7]:
obj2 = Series([4,7,-5,3],index=['d','a','b','c'])
obj2

d    4
a    7
b   -5
c    3
dtype: int64

In [8]:
obj2.index

Index(['d', 'a', 'b', 'c'], dtype='object')

In [9]:
obj2['a']

7

In [11]:
obj2[['a','b','c']]

a    7
b   -5
c    3
dtype: int64

In [13]:
obj2[obj2>0] #筛选

d    4
a    7
c    3
dtype: int64

In [14]:
'b' in obj2

True

In [15]:
'e' in obj2 #查找

False

In [16]:
sdata = {'Ohio':35000,'Texas':71000,'Oregen':16000,'Utah':5000}
obj3 = Series(sdata)
obj3

Ohio      35000
Texas     71000
Oregen    16000
Utah       5000
dtype: int64

In [17]:
states = ['California','Ohio','Oregen','Texas']
obj4 = Series(sdata,index=states)
obj4

California        NaN
Ohio          35000.0
Oregen        16000.0
Texas         71000.0
dtype: float64

In [19]:
pd.isnull(obj4) #检测缺失数据

California     True
Ohio          False
Oregen        False
Texas         False
dtype: bool

In [20]:
pd.notnull(obj4)

California    False
Ohio           True
Oregen         True
Texas          True
dtype: bool

In [22]:
#DataFrame
data = {'state':['California','Ohio','Oregen','Texas'],'year':[2000,2001,2001,2003],'pop':[1.0,1.5,1.6,1.7]}

In [23]:
frame = DataFrame(data)
frame

        state  year  pop
0  California  2000  1.0
1        Ohio  2001  1.5
2      Oregen  2001  1.6
3       Texas  2003  1.7

In [24]:
DataFrame(data,columns=['year','pop','state'])

   year  pop       state
0  2000  1.0  California
1  2001  1.5        Ohio
2  2001  1.6      Oregen
3  2003  1.7       Texas

In [28]:
frame2 = DataFrame(data,columns=['year','pop','state','debt'],index=['one','two','three','four'])
frame2

       year  pop       state debt
one    2000  1.0  California  NaN
two    2001  1.5        Ohio  NaN
three  2001  1.6      Oregen  NaN
four   2003  1.7       Texas  NaN

In [29]:
frame2.columns

Index(['year', 'pop', 'state', 'debt'], dtype='object')

In [31]:
frame2['year']

one      2000
two      2001
three    2001
four     2003
Name: year, dtype: int64

In [32]:
frame2.year

one      2000
two      2001
three    2001
four     2003
Name: year, dtype: int64

In [34]:
frame2.loc['two'] #基于label定位行

year     2001
pop       1.5
state    Ohio
debt      NaN
Name: two, dtype: object

In [35]:
frame2.iloc[0] #基于行号定位行

year           2000
pop               1
state    California
debt            NaN
Name: one, dtype: object

In [36]:
frame2['debt']=16.5
frame2

       year  pop       state  debt
one    2000  1.0  California  16.5
two    2001  1.5        Ohio  16.5
three  2001  1.6      Oregen  16.5
four   2003  1.7       Texas  16.5

In [41]:
frame2['debt'] = np.arange(4)
frame2

       year  pop       state  debt
one    2000  1.0  California     0
two    2001  1.5        Ohio     1
three  2001  1.6      Oregen     2
four   2003  1.7       Texas     3

In [42]:
frame2['eastern'] = frame2.state=='Ohio'
frame2

       year  pop       state  debt  eastern
one    2000  1.0  California     0    False
two    2001  1.5        Ohio     1     True
three  2001  1.6      Oregen     2    False
four   2003  1.7       Texas     3    False

In [43]:
del frame2['eastern']
frame2

       year  pop       state  debt
one    2000  1.0  California     0
two    2001  1.5        Ohio     1
three  2001  1.6      Oregen     2
four   2003  1.7       Texas     3

In [3]:
# 基本功能
obj = Series([4.5,7.2,-5.3,3.6],index=['d','b','a','c'])
obj

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

In [4]:
obj2 = obj.reindex(['a','b','c','d'])
obj2

a   -5.3
b    7.2
c    3.6
d    4.5
dtype: float64

In [5]:
obj.reindex(['a','b','c','d','e'],fill_value=0)

a   -5.3
b    7.2
c    3.6
d    4.5
e    0.0
dtype: float64

In [10]:
obj3 = Series(['blue','pink','yellow'],index=[0,2,4])
obj3.reindex(range(6),method='ffill')

0      blue
1      blue
2      pink
3      pink
4    yellow
5    yellow
dtype: object

In [33]:
frame = DataFrame(np.arange(9).reshape((3,3)),index=['a','c','d'],columns=['Ohio','Texas','California'])
frame

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [13]:
frame2 = frame.reindex(['a','b','c','d'])
frame2

   Ohio  Texas  California
a   0.0    1.0         2.0
b   NaN    NaN         NaN
c   3.0    4.0         5.0
d   6.0    7.0         8.0

In [14]:
frame.reindex(columns=['Texas','California','Utah','Ohio'])

   Texas  California  Utah  Ohio
a      1           2   NaN     0
c      4           5   NaN     3
d      7           8   NaN     6

In [61]:
frame.reindex(index=['a','b','c','d'],columns=['Texas','California','Utah','Colorado']) #loc来重新索引已经被reindex代替

   Texas  California  Utah  Colorado
a    1.0         2.0   NaN       NaN
b    NaN         NaN   NaN       NaN
c    4.0         5.0   NaN       NaN
d    7.0         8.0   NaN       NaN

In [29]:
frame

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [42]:
frame.drop(['a','c'])

   Ohio  Texas  California
d     6      7           8

In [43]:
obj

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

In [44]:
obj4 = Series(np.arange(4.),index=['a','b','c','d'])

In [45]:
obj4

a    0.0
b    1.0
c    2.0
d    3.0
dtype: float64

In [46]:
obj4['b']

1.0

In [48]:
obj4[2:5]

c    2.0
d    3.0
dtype: float64

In [49]:
obj4['b':'c'] #末端包含

b    1.0
c    2.0
dtype: float64

In [51]:
obj4['b':'c']=10
obj4

a     0.0
b    10.0
c    10.0
d     3.0
dtype: float64

In [52]:
data = DataFrame(np.arange(16).reshape((4,4)),index=['Ohio','Colorado','Utah','New York'],
                 columns=['one','two','three','four'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [53]:
data['two']

Ohio         1
Colorado     5
Utah         9
New York    13
Name: two, dtype: int64

In [55]:
data[['one','three']]

          one  three
Ohio        0      2
Colorado    4      6
Utah        8     10
New York   12     14

In [56]:
data[data['three']<10]

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7

In [66]:
data.loc[data.three<10,:]

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7

In [67]:
frame2 = DataFrame(np.random.randn(4,3),columns=list('bde'),
                  index=['Ohio','Colorado','Utah','New York'])
frame2

                 b         d         e
Ohio      0.620473  0.527054  0.166445
Colorado  0.097177  0.072667 -0.013469
Utah      1.049750  0.902532  0.873480
New York  0.017106  0.179157 -0.324665

In [68]:
np.abs(frame2)

                 b         d         e
Ohio      0.620473  0.527054  0.166445
Colorado  0.097177  0.072667  0.013469
Utah      1.049750  0.902532  0.873480
New York  0.017106  0.179157  0.324665

In [69]:
f = lambda x:x.max()-x.min()
frame2.apply(f)

b    1.032644
d    0.829866
e    1.198145
dtype: float64

In [70]:
frame2.apply(f,axis=1)

Ohio        0.454028
Colorado    0.110646
Utah        0.176270
New York    0.503822
dtype: float64

In [71]:
def f2(x):
    return Series([x.min(),x.max()],index=['min','max'])
frame2.apply(f2)

            b         d         e
min  0.017106  0.072667 -0.324665
max  1.049750  0.902532  0.873480

In [74]:
format = lambda x: '%.2f' %x #保留两位小数

frame2.applymap(format)

             b     d      e
Ohio      0.62  0.53   0.17
Colorado  0.10  0.07  -0.01
Utah      1.05  0.90   0.87
New York  0.02  0.18  -0.32

In [76]:
frame2['e'].map(format)

Ohio         0.17
Colorado    -0.01
Utah         0.87
New York    -0.32
Name: e, dtype: object